IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/RTI2_RTI2.xml
	<register id="RTI2_RTICPUC1" acronym="RTI2_RTICPUC1" offset="0x38" width="32" description="">
		<bitfield id="CPUC1" width="32" begin="31" end="0" resetval="0x0" description="This registers holds the compare value, which is compared with the Up Counter 1. When the compare matches, Free Running Counter 1 is incremented. The Up Counter is set to zero when the counter value matches the CPUC1 value. The value set in this prescales the RTI clock.If CPUC1 = 0: then, frequency = RTICLK/ (2^32)If CPUC1 ? 0: then , frequency = RTICLK/(CPUC1 + 1)User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changed" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICAFRC1" acronym="RTI2_RTICAFRC1" offset="0x40" width="32" description="">
		<bitfield id="CAFRC1" width="32" begin="31" end="0" resetval="0x0" description="CAFRC1: Capture Free Running Counter 1.This registers captures the current value of the Free Running Counter 1 when a event occurs, controlled by the external capture control block.User and privilege mode (read):value of Free Running Counter 1 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICAUC1" acronym="RTI2_RTICAUC1" offset="0x44" width="32" description="">
		<bitfield id="CAUC1" width="32" begin="31" end="0" resetval="0x0" description="CAUC1: Capture Up Counter 1.This registers captures the current value of the Up Counter 1 when a event occurs, controlled by the external capture control block. The read sequence has to be the same as with Up Counter 1 and Free Running Counter 1. So the RTICAFRC1 register has to be read first, before the RTICAUC1 register is read. This sequence ensures that the value of the RTICAUC1 register is the corresponding value to the RTICAFRC1 register, even if another capture event happens in between the two reads.User and privilege mode (read):value of Up Counter 1 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICOMP0" acronym="RTI2_RTICOMP0" offset="0x50" width="32" description="">
		<bitfield id="COMP0" width="32" begin="31" end="0" resetval="0x0" description="COMP0: Compare 0.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTIUDCP0" acronym="RTI2_RTIUDCP0" offset="0x54" width="32" description="">
		<bitfield id="UDCP0" width="32" begin="31" end="0" resetval="0x0" description="UDCP0: Update Compare 0 Register.This registers holds a value, which is added to the value in the compare 0 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 0 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICOMP1" acronym="RTI2_RTICOMP1" offset="0x58" width="32" description="">
		<bitfield id="COMP1" width="32" begin="31" end="0" resetval="0x0" description="COMP1: compare1.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTIUDCP1" acronym="RTI2_RTIUDCP1" offset="0x5C" width="32" description="">
		<bitfield id="UDCP1" width="32" begin="31" end="0" resetval="0x0" description="UDCP1: Update compare1 Register.This registers holds a value, which is added to the value in the compare1 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare1 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICOMP2" acronym="RTI2_RTICOMP2" offset="0x60" width="32" description="">
		<bitfield id="COMP2" width="32" begin="31" end="0" resetval="0x0" description="COMP2: compare 2.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTIUDCP2" acronym="RTI2_RTIUDCP2" offset="0x64" width="32" description="">
		<bitfield id="UDCP2" width="32" begin="31" end="0" resetval="0x0" description="UDCP2: Update compare 2 Register.This registers holds a value, which is added to the value in the compare 2 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 2 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTICOMP3" acronym="RTI2_RTICOMP3" offset="0x68" width="32" description="">
		<bitfield id="COMP3" width="32" begin="31" end="0" resetval="0x0" description="COMP3: compare 3.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTIUDCP3" acronym="RTI2_RTIUDCP3" offset="0x6C" width="32" description="">
		<bitfield id="UDCP3" width="32" begin="31" end="0" resetval="0x0" description="UDCP3: Update compare 3 Register.This registers holds a value, which is added to the value in the compare 3 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 3 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTITBLCOMP" acronym="RTI2_RTITBLCOMP" offset="0x70" width="32" description="">
		<bitfield id="TBLCOMP" width="32" begin="31" end="0" resetval="0x0" description="TBLCOMP: Timebase Low Compare Value.This value determines when the edge detection circuit starts monitoring the NTUx signal. It will be compared with Up Counter 0.User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changedNote: Reset behaviorA reset does not generate a compare match." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI2_RTITBHCOMP" acronym="RTI2_RTITBHCOMP" offset="0x74" width="32" description="">
		<bitfield id="TBHCOMP" width="32" begin="31" end="0" resetval="0x0" description="TBHCOMP: Timebase High Compare Value.This value determines when the edge detection circuit will stop monitoring the NTUx signal. It will be compared with Up Counter 0.RTITBHCOMP has to be less than RTICPUC0, since RTIUC0 will be reset when RTICPUC0 is reached.Example:The NTUx edge detection circuit should be active +/- 10 RTICLK cycles around RTICPUC0.RTICPUC0 = 0x00000050RTITBLCOMP = 0x000046RTITBHCOMP = 0x00000009User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changedNote: Reset behaviorA reset does not generate a compare match." range="31 - 0" rwaccess="RW"/>
	</register>
